template/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-20 -20 0)			//0
    ( 20 -20 0)			//1
    (100 -20 0)			//2
    (-0.7071 -0.7071 0)		//3
    ( 0.7071 -0.7071 0)		//4
    (-0.7071  0.7071 0)		//5
    ( 0.7071  0.7071 0)		//6
    (-20 20 0)			//7
    ( 20 20 0)			//8
    (100 20 0)			//9


    (-7.071 -7.071 0)		//10
    ( 7.071 -7.071 0)		//11
    (-7.071 7.071 0)		//12
    ( 7.071 7.071 0)		//13


    (-20 -20 1)			//14
    ( 20 -20 1)			//15
    (100 -20 1)			//16
    (-0.7071 -0.7071 1)		//17
    ( 0.7071 -0.7071 1)		//18
    (-0.7071  0.7071 1)		//19
    ( 0.7071  0.7071 1)		//20
    (-20 20 1)			//21
    ( 20 20 1)			//22
    (100 20 1)			//23

    (-7.071 -7.071 1)         //24
    ( 7.071 -7.071 1)         //25
    (-7.071 7.071 1)         //26
    ( 7.071 7.071 1)         //27

);

blocks
(

hex (10 3 5 12 24 17 19 26) (80 80 1) simpleGrading (.1 1 1) // inner left sectro
hex (11 4 3 10 25 18 17 24) (80 80 1) simpleGrading (.1 1 1) //inner bottom sector
hex (13 6 4 11 27 20 18 25) (80 80 1) simpleGrading (.1 1 1) // inner right sector
hex (12 5 6 13 26 19 20 27) (80 80 1) simpleGrading (.1 1 1) //inner top sector

hex (0 10 12 7 14 24 26 21) (40 80 1) simpleGrading (1 1 1) //outer left
hex (1 11 10 0 15 25 24 14) (40 80 1) simpleGrading (1 1 1) // outer bottom sector
hex (8 13 11 1 22 27 25 15) (40 80 1) simpleGrading (1 1 1) //outer right sector
hex (7 12 13 8 21 26 27 22) (40 80 1) simpleGrading (1 1 1) //outer top sector

hex (1 2 9 8 15 16 23 22) (200 80 1) simpleGrading (1 1 1) //wake tail volume

);

edges
(
	arc 3 5 (-1 0 0)
	arc 4 6 (1 0 0)
	arc 5 6 (0 1 0)
	arc 3 4 (0 -1 0)

	arc 12 10 (-10 0 0)
	arc 11 13 (10 0 0)
	arc 12 13 (0 10 0)
	arc 10 11 (0 -10 0)

	arc 17 19 (-1 0 1)
	arc 18 20 (1 0 1)
	arc 19 20 (0 1 1)
	arc 17 18 (0 -1 1)

	arc 26 24 (-10 0 1)
	arc 25 27 (10 0 1)
	arc 26 27 (0 10 1)
	arc 24 25 (0 -10 1)

);

boundary
(
    inlet
    {
        type wall;
        faces
        (
            (7 0 14 21)
        );
    }

    outlet
    {
        type wall;
        faces
        (
            (9 2 16 23)
        );
    }

    top
    {
        type wall;
        faces
        (
            (8 7 21 22)
	    (9 8 22 23)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (0 1 15 14)
	    (1 2 16 15)
        );
    }

    cylinder
    {
        type wall;
        faces
        (
            (5 6 20 19)
	    (6 4 18 20)
	    (4 3 17 18)
	    (3 5 19 17)
        );
    }

    sides
    {
        type empty;
        faces
        (
        (7 8 13 12)
	(7 12 10 0)
	(10 11 1 0)
	(8 1 11 13)

	(10 11 4 3)
	(11 13 6 4)
	(13 12 5 6)
	(12 10 3 5)
	(8 9 2 1)

	(24 25 18 17)
	(25 27 20 18)
	(27 26 19 20)
	(26 24 17 19)
	(22 23 16 15)

        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //

