template/system/streamFunction
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes the steam-function pointScalarField calculated from the specified
    flux surfaceScalarField.

\*---------------------------------------------------------------------------*/

type            streamFunction;
libs            ("libfieldFunctionObjects.so");

field           phi;

executeControl  writeTime;
writeControl    writeTime;

// ************************************************************************* //
